In [ ]:
# Documentation
https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior

In [4]:
import datetime

In [2]:
from datetime import date

In [5]:
date.today()

datetime.date(2025, 5, 30)

In [6]:
x = date.today()

In [7]:
type(x)

datetime.date

In [8]:
x.day

30

In [9]:
x.month

5

In [10]:
x.year

2025

In [11]:
x.strftime("%a")

'Fri'

In [12]:
x.strftime("%A")

'Friday'

In [46]:
x.strftime("%B")

'May'

In [14]:
x.strftime("%c")

'Fri May 30 00:00:00 2025'

In [16]:
x.strftime("%p")

'AM'

In [18]:
x.strftime("%Y")

'2025'

In [ ]:
# Use Case

In [19]:
import pandas as pd

In [33]:
import warnings
warnings.filterwarnings("ignore")

In [22]:
data = pd.read_csv("F:\\KSR\\Sample - Superstore.csv", encoding = "ISO-8859-1")

In [23]:
data.head(3)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country/Region,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,2698,CA-2016-145317,18-03-2016,23-03-2016,Standard Class,SM-20320,Sean Miller,Home Office,United States,Jacksonville,...,32216.0,South,TEC-MA-10002412,Technology,Machines,Cisco TelePresence System EX90 Videoconferenci...,22638.48,6,0.5,-1811.0784
1,6827,CA-2018-118689,02-10-2018,09-10-2018,Standard Class,TC-20980,Tamara Chand,Corporate,United States,Lafayette,...,47905.0,Central,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,17499.95,5,0.0,8399.9760
2,8154,CA-2019-140151,23-03-2019,25-03-2019,First Class,RB-19360,Raymond Buch,Consumer,United States,Seattle,...,98115.0,West,TEC-CO-10004722,Technology,Copiers,Canon imageCLASS 2200 Advanced Copier,13999.96,4,0.0,6719.9808

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          9994 non-null   int64
 1   Order ID        9994 non-null   object
 2   Order Date      9994 non-null   object
 3   Ship Date       9994 non-null   object
 4   Ship Mode       9994 non-null   object
 5   Customer ID     9994 non-null   object
 6   Customer Name   9994 non-null   object
 7   Segment         9994 non-null   object
 8   Country/Region  9994 non-null   object
 9   City            9994 non-null   object
 10  State           9994 non-null   object
 11  Postal Code     9983 non-null   float64
 12  Region          9994 non-null   object
 13  Product ID      9994 non-null   object
 14  Category        9994 non-null   object
 15  Sub-Category    9994 non-null   object
 16  Product Name    9994 non-null   object
 17  Sales           9994 non-null   float64
 18  Quantity        9994 non-null   int64
 19  Discount        9994 non-null   float64
 20  Profit          9994 non-null   float64
dtypes: float64(4), int64(2), object(15)
memory usage: 1.6+ MB

In [26]:
df = data[["Order Date","Segment","Category","Sub-Category","Sales","Profit"]]

In [27]:
df.head(5)

   Order Date      Segment    Category Sub-Category      Sales     Profit
0  18-03-2016  Home Office  Technology     Machines  22638.480 -1811.0784
1  02-10-2018    Corporate  Technology      Copiers  17499.950  8399.9760
2  23-03-2019     Consumer  Technology      Copiers  13999.960  6719.9808
3  22-10-2019  Home Office  Technology      Copiers  11199.968  3919.9888
4  01-01-2018     Consumer  Technology      Copiers  10499.970  5039.9856

In [28]:
df.dtypes

Order Date       object
Segment          object
Category         object
Sub-Category     object
Sales           float64
Profit          float64
dtype: object

In [ ]:
# 1. change Order date object datatype to datetime datatype

In [34]:
df['Order Date'] = pd.to_datetime(df['Order Date'])

In [32]:
df.dtypes

Order Date      datetime64[ns]
Segment                 object
Category                object
Sub-Category            object
Sales                  float64
Profit                 float64
dtype: object

In [35]:
df.head(5)

  Order Date      Segment    Category Sub-Category      Sales     Profit
0 2016-03-18  Home Office  Technology     Machines  22638.480 -1811.0784
1 2018-10-02    Corporate  Technology      Copiers  17499.950  8399.9760
2 2019-03-23     Consumer  Technology      Copiers  13999.960  6719.9808
3 2019-10-22  Home Office  Technology      Copiers  11199.968  3919.9888
4 2018-01-01     Consumer  Technology      Copiers  10499.970  5039.9856

In [ ]:
# Create new col Year to findout yearly sales

In [36]:
df['Year'] = df['Order Date'].dt.year

In [37]:
df.head(3)

  Order Date      Segment    Category Sub-Category     Sales     Profit  Year
0 2016-03-18  Home Office  Technology     Machines  22638.48 -1811.0784  2016
1 2018-10-02    Corporate  Technology      Copiers  17499.95  8399.9760  2018
2 2019-03-23     Consumer  Technology      Copiers  13999.96  6719.9808  2019

In [38]:
df.groupby("Year")[['Sales']].sum()

            Sales
Year
2016  484247.4981
2017  470532.5090
2018  619705.5680
2019  722715.2852

In [47]:
# create new col Month 
df['Month'] = df['Order Date'].dt.strftime("%B")

In [48]:
df.head(2)

,Order Date,Segment,Category,Sub-Category,Sales,Profit,Year,Month
0,2016-03-18,Home Office,Technology,Machines,22638.48,-1811.0784,2016,March
1,2018-10-02,Corporate,Technology,Copiers,17499.95,8399.9760,2018,October

In [ ]:
# Find out which day we had highest sales?

In [49]:
# Create new col day
df['Day'] = df['Order Date'].dt.day_name()

In [50]:
df.head(5)

,Order Date,Segment,Category,Sub-Category,Sales,Profit,Year,Month,Day
0,2016-03-18,Home Office,Technology,Machines,22638.480,-1811.0784,2016,March,Friday
1,2018-10-02,Corporate,Technology,Copiers,17499.950,8399.9760,2018,October,Tuesday
2,2019-03-23,Consumer,Technology,Copiers,13999.960,6719.9808,2019,March,Saturday
3,2019-10-22,Home Office,Technology,Copiers,11199.968,3919.9888,2019,October,Tuesday
4,2018-01-01,Consumer,Technology,Copiers,10499.970,5039.9856,2018,January,Monday

In [52]:
    df.groupby('Day')[['Sales']].sum().sort_values('Sales', ascending = False)

                 Sales
Day
Monday     406514.1959
Wednesday  392859.0138
Tuesday    373021.0407
Sunday     330891.6081
Thursday   308127.6932
Saturday   288238.6406
Friday     197548.6680

In [53]:
# which month had highest sales?
df.groupby('Month')[['Sales']].sum().sort_values('Sales', ascending=False)

                 Sales
Month
November   341961.1010
December   325293.5035
September  307649.9457
March      205005.4888
October    200322.9847
August     159044.0630
May        155028.8117
June       152718.6793
July       147238.0970
April      137762.1286
January    105424.8056
February    59751.2514

In [ ]:
# which year had highest sales?
df.groupby('Year')[['Sales']].sum().so